package homework.homework12.txt2;

public class Inheritance {

	public static void main(String[] args) {
//		1. 성씨, 혈액형, 키, 피부색을 속성으로 가지는 Parent 클래스를 생성하고
//		Parent를 상속받은 ChildA, ChildB 클래스를 만들어서
//	    ChildA에는 이름 속성을 추가하고 ChildB에는 지문 속성을 추가하세요.

//	    2. 일한 시간, 시간당 급여를 속성으로 갖는 알바라는 클래스를 만들고 일한다
//		(일한 시간동안 일해서 일한 시간 * 시간당 급여를 받는다. 라고 출력하는)를 메소드로 만드세요.
//	    알바를 상속받는 캐셔와 쿠팡맨 클래스를 만들고 일한다 메소드를 오버라이딩하여
//		캐셔는 "캐셔는 일한 시간동안 계산해서 일한 시간 * 시간당 급여를 받는다."
//	    쿠팡맨은  "쿠팡맨은 일한 시간동안 배송해서 일한 시간 * 시간당 급여를 받는다."라고 출력하도록 구현하세요.
//		일한 시간과 시간당 급여는 생성자에서 초기화합니다.

//	    3. 근로자를 인터페이스로 생성하고 출근하다, 퇴근하다, 일한다. 메소드를 선언합니다.
//	    근로자를 상속받은 개발자와 공무원 클래스 만들고 상속받은 세 개의 메소드를 본인이 원하는 대로 구현하세요.

//	    4. 게시판 인터페이스를 구현하고 게시글 저장, 수정, 삭제, 조회 메소드를 만들고
//	    게시판을 상속받는 자유게시판과 공지게시판 클래스를 만들어서 네 개의 메소드를 본인이 원하는 대로 구현하세요.
	}

}
